[
  {
    "title": "The Road of Dreams",
    "description": "I walk a road of stone and dust,\nWith feet unsure, but heart in trust.\nThe world is wide, the climb is steep,\nYet in my soul, a fire I keep.\n\nEach dream I hold is light and strong,\nIt sings to me a silent song.\nThough winds may push and skies may cry,\nI’ll chase my dream and learn to fly.\n",
    "dateCreated": "2025-06-18"
  },
  {
    "title": "The Rain Didn’t Ask for an Audience",
    "description": "The rain just came, without a sound,\nNo stage, no lights, no cheering crowd.\nIt touched the trees, it kissed the ground,\nAnd danced around, both soft and proud.\n\nNo message sent, no plan was made,\nNo selfie snapped, no hashtags laid.\nIt fell on roofs, on roads, on skin,\nJust being rain—it felt like kin.\n\nI watched it fall from my small gate,\nWith chai in hand, I stood and ate\nSome dreams I once had kept inside,\nLike paper boats I used to ride.\n\nNo need for likes, or someone’s praise,\nThe rain just lived its quiet days.\nIt did not beg for screens to glow,\nIt simply came, and let life flow.\n\nWe chase so much to feel we shine,\nBut rain just comes, and says, “That’s fine.”\nNo noise, no fame, no fancy role—\nYet still, it deeply touched my soul.\n",
    "dateCreated": "2025-07-21"
  },
  {
    "title": "The Wi-Fi Went Out – So I Met Myself",
    "description": "The Wi-Fi blinked, then disappeared—\na digital death I used to fear.\nNo pings, no memes, no urgent mails,\njust silence riding data’s trails.\n\nAt first, I panicked—checked the lights,\nrebooted twice, refreshed the nights.\nBut nothing came. No buzzing feed.\nOnly… me. And time. And need.\n\nThe walls, they sighed with stories old,\nthe books I bought but never told.\nThe mirror caught a stranger’s gaze—\neyes like dusk, and thoughts ablaze.\n\nI brewed some tea I never taste,\nin mugs I kept “just in case.”\nThe quiet hummed like something true,\na softer world I never knew.\n\nI found old songs beneath the dust,\nand poems penned in quiet trust.\nI laughed alone—and it was fine.\nI cried a bit. That too was mine.\n\nI met the version I’d delayed,\nbeneath the scroll, beneath the shade.\nA soul unliked, unshared, unread—\nbut very much alive, not dead.\n\nThe Wi-Fi came back late next day.\nThe world resumed its endless play.\nBut now and then, I let it go—\nto meet myself in silent flow.\n",
    "dateCreated": "2025-07-02"
  }
]
